Documents/Талоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Талоны</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КоличествоЛьготВыдано</xr:Item>
				<xr:Item>InformationRegister.ТалоныНаЛьготы</xr:Item>
				<xr:Item>AccumulationRegister.КоличествоЛьготПоКатегориям</xr:Item>
				<xr:Item>InformationRegister.НумирацияТалонов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДолжностьДляРосписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникДляРосписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СельскийСовет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СельскиеСоветы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьгот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВедомости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТалоныТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДомовладельца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПолучателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаОтпуска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПолучателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДействияТалона</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СельскийСовет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СельскиеСоветы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтпускаУгля</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛичноеДело</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачиЗаявителю</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕденицыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕденицыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомплектностьДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подстановка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформацияПоВыдаче</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачиЗаявителю</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Информация2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредметЛьготы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ТалоныНаЛьготы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТалоныНаЛьготы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресДомовладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредметЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредметЛьготы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаОтпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодДействияТалона</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиЗаявителю</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтпускаУгля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛичноеДело</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьгот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛьготнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛьготныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НумирацияТалонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НумирацияТалонов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследнийНомерТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьгот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Талоны/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


//*****************************************************
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

//*****************************************************
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


//*****************************************************

//4. Добавить в процедуру "ПослеЗаписи"
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
	


//*****************************************************


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры



// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//*****************************************************
Функция ПроверкаЗаявителяНаПовторение()
	// обдумать как переделать		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныНаЛьготыСрезПоследних.Заявитель КАК Заявитель
		|ИЗ
		|	РегистрСведений.ТалоныНаЛьготы.СрезПоследних КАК ТалоныНаЛьготыСрезПоследних
		|ГДЕ
		|	ТалоныНаЛьготыСрезПоследних.Период МЕЖДУ &Период1 И &Период2
		|	И ТалоныНаЛьготыСрезПоследних.ВидЛьготы = &ВидЛьготы";
	
	Запрос.УстановитьПараметр("ВидЛьготы", Объект.ВидЛьготы);
	Запрос.УстановитьПараметр("Период1", Объект.ВидЛьготы.ДатаНачала);
	Запрос.УстановитьПараметр("Период2", Объект.ВидЛьготы.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат 0;
	КонецЦикла;
	
	

КонецФункции	

&НаСервере
Процедура ПодготовкаЗаписиТалона()
	
КонецПроцедуры	
&НаСервере
Функция ОпределитьНомерТалона(Организация,ВидЛьготы)
	НомерТалона = 0; 		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НумирацияТалоновСрезПоследних.ПоследнийНомерТалона КАК ПоследнийНомерТалона
		|ИЗ
		|	РегистрСведений.НумирацияТалонов.СрезПоследних КАК НумирацияТалоновСрезПоследних
		|ГДЕ
		|	НумирацияТалоновСрезПоследних.Организация = &Организация
		|	И НумирацияТалоновСрезПоследних.ВидЛьготы = &ВидЛьготы";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ВидЛьготы",ВидЛьготы);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		НомерТалона = Число(СокрЛП(Выборка.ПоследнийНомерТалона))+1; 
	Иначе 
		НомерТалона = 1;
	КонецЕсли;
	
	Возврат НомерТалона;

КонецФункции	

&НаСервереБезКонтекста
Функция ВернутьСписокПодстановкиНаСервере(Организация)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДелоЛьготыСрезПоследних.Заявитель КАК Заявитель,
		|	ЛичноеДелоЛьготыСрезПоследних.Регистратор КАК Регистратор,
		|	ЕСТЬNULL(ЛичноеДелоЗакрытьСрезПоследних.ДатаЗакрытияДела, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗакрытияДела
		|ИЗ
		|	РегистрСведений.ЛичноеДелоЛьготы.СрезПоследних КАК ЛичноеДелоЛьготыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛичноеДелоЗакрыть.СрезПоследних КАК ЛичноеДелоЗакрытьСрезПоследних
		|		ПО ЛичноеДелоЛьготыСрезПоследних.Заявитель = ЛичноеДелоЗакрытьСрезПоследних.Заявитель
		|			И ЛичноеДелоЛьготыСрезПоследних.Регистратор = ЛичноеДелоЗакрытьСрезПоследних.Регистратор
		|ГДЕ
		|	ЛичноеДелоЛьготыСрезПоследних.Организация = &Организация
		|	И ЕСТЬNULL(ЛичноеДелоЗакрытьСрезПоследних.ДатаЗакрытияДела, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ ЛичноеДелоЛьготыСрезПоследних.Заявитель В
		|				(ВЫБРАТЬ
		|					ТалоныНаЛьготы.Заявитель КАК Заявитель
		|				ИЗ
		|					РегистрСведений.ТалоныНаЛьготы КАК ТалоныНаЛьготы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛичноеДелоЛьготыСрезПоследних.Заявитель,
		|	ЛичноеДелоЛьготыСрезПоследних.Регистратор,
		|	ЕСТЬNULL(ЛичноеДелоЗакрытьСрезПоследних.ДатаЗакрытияДела, ДАТАВРЕМЯ(1, 1, 1))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Заявитель";
	
	Запрос.УстановитьПараметр("Организация",Организация);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	СписокВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Заявитель);
	КонецЦикла;
	
	Если СписокВыбора.Количество() > 0 Тогда
        Возврат СписокВыбора;
    Иначе
        Возврат Неопределено;
    КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция ВернутьДанныеИзРегистра(ЭлементыПодстановки,Организация,ВидЛьготы)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичноеДелоЛьготыСрезПоследних.Заявитель КАК Заявитель,
		|	ЛичноеДелоЛьготыСрезПоследних.АдресПроживания КАК АдресДомовладельца,
		|	ЛичноеДелоЛьготыСрезПоследних.Регистратор.НомерЗаявления КАК НомерПолучателя,
		|	ЛичноеДелоЛьготыСрезПоследних.ПредметЛьготы КАК ПредметЛьготы,
		|	ЛичноеДелоЛьготыСрезПоследних.Количество КАК НормаОтпуска,
		|	ЛичноеДелоЛьготыСрезПоследних.ЕденицаИзмерения КАК ЕденицаИзмерения,
		|	ЛичноеДелоЛьготыСрезПоследних.Организация КАК Организация,
		|	ЛичноеДелоЛьготыСрезПоследних.Регистратор КАК Регистратор,
		|	ЕСТЬNULL(ЛичноеДелоЗакрытьСрезПоследних.ДатаЗакрытияДела, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗакрытияДела,
		|	ЛичноеДелоЛьготыСрезПоследних.Заявитель.СельскийСовет КАК ЗаявительСельскийСовет,
		|	ЛичноеДелоЛьготыСрезПоследних.ЛьготнаяКатегория КАК ЛьготнаяКатегория,
		|	ЛичноеДелоЛьготыСрезПоследних.НомерТалона КАК НомерТалона
		|ИЗ
		|	РегистрСведений.ЛичноеДелоЛьготы.СрезПоследних(
		|			,
		|			ВидЛьготы = &ВидЛьготы
		|				И Регистратор.Комиссия = ЛОЖЬ) КАК ЛичноеДелоЛьготыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛичноеДелоЗакрыть.СрезПоследних(, ВидЛьготы = &ВидЛьготы) КАК ЛичноеДелоЗакрытьСрезПоследних
		|		ПО ЛичноеДелоЛьготыСрезПоследних.Заявитель = ЛичноеДелоЗакрытьСрезПоследних.Заявитель
		|			И ЛичноеДелоЛьготыСрезПоследних.Регистратор = ЛичноеДелоЗакрытьСрезПоследних.Регистратор
		|ГДЕ
		|	ЛичноеДелоЛьготыСрезПоследних.Заявитель.Ссылка В(&ЭлементыПодстановки)
		|	И ЕСТЬNULL(ЛичноеДелоЗакрытьСрезПоследних.ДатаЗакрытияДела, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|	И ЛичноеДелоЛьготыСрезПоследних.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПолучателя";
		//|	И ЛичноеДелоЗакрытьСрезПоследних.Регистратор.СформированТалон = ЛОЖЬ
	
	Запрос.УстановитьПараметр("ЭлементыПодстановки", ЭлементыПодстановки);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидЛьготы", ВидЛьготы);

	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗ);
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	//
	////}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции	


&НаКлиенте
Процедура ВыборкаЛичныхДелДляТалонов()
	СписокВыбора =  ВернутьСписокПодстановкиНаСервере(Объект.Организация);
	Объект.ТалоныТЧ.Очистить();
	Если СписокВыбора = Неопределено Тогда
		Предупреждение("Документов для заполнения проведенных нет");
	Иначе	
		ЭлементыПодстановки = СписокВыбора.ОтметитьЭлементы("Выберите заявителей для запалнения талонов");
	
	//КомплектностьСтрока = "";
	
	НомерТалона = ОпределитьНомерТалона(Объект.Организация,Объект.ВидЛьготы);
    Если ЭлементыПодстановки = Истина Тогда
       	//ТЧ = Объект.КомплектностьДокумента;
		//ТЧ.Очистить();
		МассивДляВыбора = Новый Массив;
		Для Каждого ЭлементСписка Из СписокВыбора Цикл
			Если ЭлементСписка.Пометка Тогда
		        МассивДляВыбора.Добавить(ЭлементСписка.Значение);
		//        СтрокаТЧ.Подстановка = ЭлементСписка.Значение;
		//        КомплектностьСтрока  = КомплектностьСтрока + ЭлементСписка.Значение + ", ";
			КонецЕсли;
		КонецЦикла;
		МассивВыбора = ВернутьДанныеИзРегистра(МассивДляВыбора,Объект.Организация,Объект.ВидЛьготы);
		Для Каждого ЭлементМассива из МассивВыбора Цикл
			 НС = Объект.ТалоныТЧ.Добавить();
			 НС.Номер = Строка(НомерТалона); 
			 НС.Заявитель    = ЭлементМассива.Заявитель;
			 НС.АдресДомовладельца = ЭлементМассива.АдресДомовладельца;
			 НС.НормаОтпуска   =  ЭлементМассива.НормаОтпуска;
			 НС.НомерПолучателя   =  ЭлементМассива.НомерПолучателя;
			 НС.ДатаВыдачи   =  Объект.Дата;
			 НС.Категория = ЭлементМассива.ЛьготнаяКатегория;
			 НС.СельскийСовет= ЭлементМассива.ЗаявительСельскийСовет;
			 НС.ДокументОснование = ЭлементМассива.Регистратор; 
			 НомерТалона = НомерТалона +1;
		КонецЦикла;	
		КонецЕсли;

		//КомплектностьСтрока  = Лев(КомплектностьСтрока, СтрДлина(КомплектностьСтрока) - 2);
		//Элементы.ДокументыДляЛьготы.ТекущиеДанные.ЛьготныеКатегории = КомплектностьСтрока;
		//Модифицированность   = Истина;
		//
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	ВыборкаЛичныхДелДляТалонов();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.Ссылка = &Ссылка
		|	И ТалоныТалоныТЧ.ДокументОснование.ДокПроводить
		|
		|СГРУППИРОВАТЬ ПО
		|	ТалоныТалоныТЧ.Категория";
		//|	ТалоныТалоныТЧ.ДокументОснование.Группа
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Информация.Добавить();
		НоваяСтрока.Категория = Выборка.Категория;
	//	НоваяСтрока.Группа = Выборка.Группа;
		НоваяСтрока.Количество = Выборка.Количество;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Объект.Информация.Очистить();
	СформироватьНаСервере();
	
КонецПроцедуры
&НаСервере
Процедура ПолучитьКатегорию()
	
КонецПроцедуры	
&НаКлиенте
Процедура ТалоныТЧЗаявительПриИзменении(Элемент)
	//ТД = Элементы.ТалоныТЧ.ТекущиеДанные;
	////Категория = ТД.ДокументОснование.ЛьготнаяКатегория;
	//Для Каждого ТекСтрока Из ТД.Заявитель.ЛьготныеКатегории Цикл
	//		Категория = ТекСтрока.Категория;
	//	КонецЦикла;

	//ТД.Категория = Категория;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНомеПринялраТалонов(Команда)
	НомерТалона = 0;
	Для каждого Строка Из Объект.ТалоныТЧ Цикл
	    Если Строка.НомерСтроки = 1 Тогда
			НомерТалона = Число(Формат(Строка.Номер,"ЧГ=0"));
		КонецЕсли;
		    Строка.Номер = Строка(НомерТалона); 
			НомерТалона = НомерТалона +1;

	КонецЦикла; 
	
	КонецПроцедуры
&НаСервере 
Процедура ЗаписьВРегистрПолученныеТалоны(НомерПо);
	 Отбор = Новый Структура;
	 Отбор.Вставить("Организация",Объект.Организация);
	 Отбор.Вставить("ВидЛьготы",Объект.ВидЛьготы);
	 Выборка = РегистрыСведений.ПолученныеТалоны.Выбрать(,,Отбор);
	 Пока Выборка.Следующий() Цикл
		 МенеджерЗаписи = Выборка.ПолучитьМенеджерЗаписи();
		 МенеджерЗаписи.Прочитать();
		 Если МенеджерЗаписи.Закрыто = Истина Тогда
			 Продолжить;
		 КонецЕсли;	 
		 Если МенеджерЗаписи.НомерПо = НомерПо Тогда 
		 МенеджерЗаписи.Закрыто = Истина;
		 МенеджерЗаписи.Записать();
		 КонецЕсли;
	 КонецЦикла;	 
	
КонецПроцедуры	
	
&НаСервере
Процедура НомерацияТалоновНаСервере()
	Перем ПоследнийНомерТалона;
	НомерТалона = 0;
	НоваяНумерация = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НумирацияТалоновСрезПоследних.ПоследнийНомерТалона КАК ПоследнийНомерТалона
		|ИЗ
		|	РегистрСведений.НумирацияТалонов.СрезПоследних(, ) КАК НумирацияТалоновСрезПоследних
		|ГДЕ
		|	НумирацияТалоновСрезПоследних.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		 ПоследнийНомерТалона =  Число(Формат(СтрЗаменить(Выборка.ПоследнийНомерТалона," ",""),"ЧГ=0"));
	Иначе 
		 ПоследнийНомерТалона = 0;
	КонецЕсли;
	
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолученныеТалоны.НомерС КАК НомерС,
		|	ПолученныеТалоны.НомерПо КАК НомерПо
		|ИЗ
		|	РегистрСведений.ПолученныеТалоны КАК ПолученныеТалоны
		|ГДЕ
		|	ПолученныеТалоны.ВидЛьготы = &ВидЛьготы
		|	И ПолученныеТалоны.Организация = &Организация
		|	И ПолученныеТалоны.Закрыто = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидЛьготы", Объект.ВидЛьготы);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	НомерТалона = ПоследнийНомерТалона+1;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
			НомерС = Выборка.НомерС;
			НомерПо = Выборка.НомерПо;
	Для каждого Строка Из Объект.ТалоныТЧ Цикл
			Если НоваяНумерация Тогда
				НомерТалона = НомерС;
				НоваяНумерация = Ложь;
			КонецЕсли;	 
			Если НомерПо < НомерТалона Тогда 
				НоваяНумерация = Истина;
				//ЗаписьВРегистрПолученныеТалоны(НомерПо);
				Прервать;
			КонецЕсли;	
			
			Если (НомерС <= НомерТалона) И (НомерПо >= НомерТалона) Тогда
				 Если НЕ ЗначениеЗаполнено(Строка.Номер) Тогда 
				 	Строка.Номер = Строка(НомерТалона); 
				 	НомерТалона = НомерТалона +1;
				 КонецЕсли;
			КонецЕсли;	
				
		КонецЦикла;	
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НомерацияТалонов(Команда)
	НомерацияТалоновНаСервере();
КонецПроцедуры
	
	
&НаКлиенте
Процедура ПронумироватьЗаявления(Команда)
	НомерЗаявления = 0;
	Для каждого Строка Из Объект.ТалоныТЧ Цикл
	    Если Строка.НомерСтроки = 1 Тогда
			НомерЗаявления = Число(Строка.НомерПолучателя);
		КонецЕсли;
		    Строка.НомерПолучателя = Строка(НомерЗаявления); 
			НомерЗаявления = НомерЗаявления +1;

	КонецЦикла; 
	
		
КонецПроцедуры

&НаСервере
Процедура ПроставитьЗаявлениеНаСервере()
	Для каждого Строка Из Объект.ТалоныТЧ Цикл
		ТекДок = Строка.ДокументОснование.ПолучитьОбъект();
		ТекДок.НомерЗаявления  = Строка.НомерПолучателя;
		ТекДок.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьЗаявление(Команда)
	ПроставитьЗаявлениеНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьКатегория(ТД)
	Возврат ТД.ЛьготнаяКатегория;	
КонецФункции

&НаСервере
Функция ПолучитьНомерЗаявления(ТД)
	 Возврат ТД.НомерЗаявления;
КонецФункции

&НаСервере
Функция ПолучитьАдрес(ТД)
	  Возврат ТД.АдресФактическогоПроживания;
КонецФункции

&НаСервере
Функция ПолучитьСельскийСовет(ТД)
	Возврат  ТД.СельскийСовет;
КонецФункции


&НаСервере
Функция ПолучитьЗаявителя(ТД)
	Возврат  ТД.Заявитель ;	
КонецФункции
&НаСервере
Функция ПолучитьНомерТалона(ТД)
	Возврат ТД.НомерТалона;
КонецФункции



&НаКлиенте
Процедура ТалоныТЧДокументОснованиеПриИзменении(Элемент)
	ТД = Элементы.ТалоныТЧ.ТекущиеДанные;
	ТД.Заявитель = ПолучитьЗаявителя(ТД.ДокументОснование);
	ТД.АдресДомовладельца  = ПолучитьАдрес(ТД.ДокументОснование);
	ТД.Категория  = ПолучитьКатегория(ТД.ДокументОснование);
	ТД.Номер = ПолучитьНомерТалона(ТД.ДокументОснование);
	//ТД.НормаОтпуска = 2;
	ТД.НомерПолучателя   = ПолучитьНомерЗаявления(ТД.ДокументОснование);
	ТД.СельскийСовет  = ПолучитьСельскийСовет(ТД.ДокументОснование);
	ТД.ДатаВыдачи   = Объект.Дата;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДатеВыдачиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.ДатаВыдачиЗаявителю КАК ДатаВыдачи,
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.ДокументОснование.Группа КАК Группа,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.Ссылка = &Ссылка
		|	И ТалоныТалоныТЧ.ДокументОснование.ДокПроводить
		|	И НЕ ТалоныТалоныТЧ.ДатаВыдачиЗаявителю = ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТалоныТалоныТЧ.Категория,
		|	ТалоныТалоныТЧ.ДатаВыдачиЗаявителю,
		|	ТалоныТалоныТЧ.ДокументОснование.Группа";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Объект.ИнформацияПоВыдаче.Очистить();
	Пока Выборка.Следующий() Цикл                                          
		НоваяСтрока = Объект.ИнформацияПоВыдаче.Добавить();
		НоваяСтрока.ДатаВыдачиЗаявителю  = Выборка.ДатаВыдачи;
		НоваяСтрока.Категория = Выборка.Категория;
		НоваяСтрока.Группа = Выборка.Группа;
		НоваяСтрока.Количество = Выборка.Количество;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДатеВыдачи(Команда)
	ЗаполнитьПоДатеВыдачиНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПодборЛД(Команда)
	ПараметрыФормы = Новый Структура("МножественныйВыбор",Истина);
	ОткрытьФорму("Документ.ЛичноеДело.ФормаВыбора",ПараметрыФормы,Элементы.ТалоныТЧ);
КонецПроцедуры

&НаСервере
Функция ЛичноеДелоВырнутьЗаявителя(ВыбранныйЭлемент)
	Возврат   ВыбранныйЭлемент.Заявитель;
КонецФункции	
&НаСервере
Функция ПериодДействияТалона(ВидЛьготы)
	Возврат ВидЛьготы.ДатаОкончания;
КонецФункции	

&НаКлиенте
Процедура ТалоныТЧОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//НомерТалона = ОпределитьНомерТалона(Объект.Организация,Объект.ВидЛьготы);
	МассивДляВыбора = Новый Массив;

	Для Каждого ВыбранныйЭлемент из ВыбранноеЗначение Цикл
		  МассивДляВыбора.Добавить(ЛичноеДелоВырнутьЗаявителя(ВыбранныйЭлемент));
	КонецЦикла;
	МассивВыбора = ВернутьДанныеИзРегистра(МассивДляВыбора,Объект.Организация,Объект.ВидЛьготы);
		
	Для Каждого ЭлементМассива из МассивВыбора Цикл
			 НС = Объект.ТалоныТЧ.Добавить();
			 НС.Номер = ЭлементМассива.НомерТалона; 
			 НС.Заявитель    = ЭлементМассива.Заявитель;
			 НС.АдресДомовладельца = ЭлементМассива.АдресДомовладельца;
			 НС.НормаОтпуска   =  ЭлементМассива.НормаОтпуска;
			 НС.ЕденицыИзмерения   =  ЭлементМассива.ЕденицаИзмерения;
			 НС.НомерПолучателя   =  ЭлементМассива.НомерПолучателя;
			 НС.ДатаВыдачи   =  Объект.Дата;
			 НС.ПериодДействияТалона = ПериодДействияТалона(Объект.ВидЛьготы);
			 НС.Категория = ЭлементМассива.ЛьготнаяКатегория;
			 НС.СельскийСовет= ЭлементМассива.ЗаявительСельскийСовет;
			 НС.ДокументОснование = ЭлементМассива.Регистратор; 
			 НС.ПредметЛьготы = ЭлементМассива.ПредметЛьготы;
			 //НомерТалона = НомерТалона +1;
		КонецЦикла;	


КонецПроцедуры


&НаСервере
Процедура СоздатьРешениеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи1 КАК ФИО1,
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи2 КАК ФИО2,
			|	УчетнаяПолитикаСрезПоследних.ФИОЛьготыДляПодписи3 КАК ФИО3
			|ИЗ
			|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитикаСрезПоследних
			|ГДЕ
			|	УчетнаяПолитикаСрезПоследних.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
			
	РезультатЗапроса = Запрос.Выполнить();
			
	Выборка = РезультатЗапроса.Выбрать();
			
	
	Для Каждого СтрокаТаб Из Объект.ТалоныТЧ Цикл
		Док = Документы.Решение.СоздатьДокумент();
		Док.Дата = СтрокаТаб.ДокументОснование.ДатаЗаявления;
		Док.Заявитель =  СтрокаТаб.Заявитель;
		Док.Решение  = СтрокаТаб.ДокументОснование.Решение;
		Док.ДатаНачало = СтрокаТаб.ДокументОснование.ДатаЗаявления;
		Док.ДатаОкончания = Объект.ВидЛьготы.ДатаОкончания;		
		Док.ДокументОснование = СтрокаТаб.ДокументОснование;
		Док.НомерЗаявленияДата = СтрокаТаб.НомерПолучателя + " от " + Строка(Формат(СтрокаТаб.ДокументОснование.ДатаЗаявления,"ДФ=dd.MM.yyyy"));
		Док.Организация = Объект.Организация;
		Док.ВидЛьготы = Объект.ВидЛьготы;
		Док.ЛьготнаяКатегория = СтрокаТаб.Категория;
		
		//Пока Выборка.Следующий() Цикл
		//	НоваяСтрока = Док.Комиссия.Добавить();
		//	НоваяСтрока.Сотрудник = Выборка.ФИО1;
		//	НоваяСтрока.Должность =  Выборка.ФИО1.Должность;
		//	НоваяСтрока = Док.Комиссия.Добавить();
		//	НоваяСтрока.Сотрудник = Выборка.ФИО2;
		//	НоваяСтрока.Должность =  Выборка.ФИО2.Должность;
		//	НоваяСтрока = Док.Комиссия.Добавить();
		//	НоваяСтрока.Сотрудник = Выборка.ФИО3;
		//	НоваяСтрока.Должность =  Выборка.ФИО3.Должность;
		//КонецЦикла;
		Док.Записать();
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьРешение(Команда)
	СоздатьРешениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПредметыЛьготыСформироватьНаСервере2()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.ПредметЛьготы КАК ПредметЛьготы,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.Ссылка = &Ссылка
		|	И ТалоныТалоныТЧ.ДокументОснование.ДокПроводить 
		|
		|СГРУППИРОВАТЬ ПО
		|	ТалоныТалоныТЧ.ПредметЛьготы";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Информация2.Добавить();
		НоваяСтрока.ПредметЛьготы = Выборка.ПредметЛьготы;
		НоваяСтрока.Количество = Выборка.Количество;
	
	КонецЦикла;


КонецПроцедуры	
&НаСервере
Процедура ПредметыЛьготыСформироватьНаСервере()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТалоныТалоныТЧ.Категория КАК Категория,
		|	ТалоныТалоныТЧ.ПредметЛьготы КАК ПредметЛьготы,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Документ.Талоны.ТалоныТЧ КАК ТалоныТалоныТЧ
		|ГДЕ
		|	ТалоныТалоныТЧ.Ссылка = &Ссылка
		|	И ТалоныТалоныТЧ.ДокументОснование.ДокПроводить
		|
		|СГРУППИРОВАТЬ ПО
		|	ТалоныТалоныТЧ.Категория,
		|	ТалоныТалоныТЧ.ПредметЛьготы";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Информация1.Добавить();
		НоваяСтрока.Категория = Выборка.Категория;
		НоваяСтрока.ПредметЛьготы = Выборка.ПредметЛьготы;
		НоваяСтрока.Количество = Выборка.Количество;

	КонецЦикла;
	

КонецПроцедуры


&НаКлиенте
Процедура ПредметыЛьготыСформировать(Команда)
	Объект.Информация1.Очистить();
	Объект.Информация2.Очистить();
	ПредметыЛьготыСформироватьНаСервере();
	ПредметыЛьготыСформироватьНаСервере2();
КонецПроцедуры
